In [15]:
import pandas as pd
import seaborn as sns  # Îç∞Ïù¥ÌÑ∞ ÏòàÏ†ú Î∂àÎü¨Ïò§Îäî Ïö©

### üéà Apply()

In [16]:
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'fare']]
# df['fare'] = df['fare'].round(1)
df['ten'] = 10
print(df.head())

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10

In [17]:
# Î∞©Î≤ï 1

def add_5(n) :
  return n + 5

for i in range(len(df)):
  df.iloc[i, 0] = add_5(df.iloc[i, 0])

print(df.age)

0      27.0
1      43.0
2      31.0
3      40.0
4      40.0
       ...
886    32.0
887    24.0
888     NaN
889    31.0
890    37.0
Name: age, Length: 891, dtype: float64

In [18]:
# Î∞©Î≤ï 2

sr1 = df['age'].apply(add_5)  # Í∞ùÏ≤¥.apply(Ï†ÅÏö©Ìï† Ìï®ÏàòÎ™Ö)
print(sr1)

0      32.0
1      48.0
2      36.0
3      45.0
4      45.0
       ...
886    37.0
887    29.0
888     NaN
889    36.0
890    42.0
Name: age, Length: 891, dtype: float64

In [19]:
# Î∞©Î≤ï 3

sr1 = df['age'].apply(lambda x: x-5)
# ÎûåÎã§ Ìï®Ïàò Ïù¥Ï†úÏïº Ïù¥Ìï¥Îêú..;; Ìï®ÏàòÏÑ†Ïñ∏ÏùÑ ÏïΩÏãùÏúºÎ°ú Ï†ÄÍ∏∞Îã§Í∞Ä..
print(sr1)

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

### üéÜ Concat()

In [20]:
df1 = pd.DataFrame({'a':['a0', 'a1', 'a2', 'a3'],
                    'b':['b0', 'b1', 'b2', 'b3'],
                    'c':['c0', 'c1', 'c2', 'c3']}, 
                   index=[0, 1, 2, 3])

df2 = pd.DataFrame({'a':['a2', 'a3', 'a4', 'a5'],
                    'b':['b2', 'b3', 'b4', 'b5'],
                    'c':['c2', 'c3', 'c4', 'c5'],
                    'd':['d2', 'd3', 'd4', 'd5']}, 
                   index=[2, 3, 4, 5])

print(df1)
print(df2)

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3
    a   b   c   d
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5

In [21]:
result1 = df1 + df2
print(result1)  # Í≤πÏπòÎäî Ìï≠Î™©Îßå Î¶¨ÌÑ¥ÌïòÍ≥† ÎÇòÎ®∏ÏßÄÎäî NaN

      a     b     c   d
0   NaN   NaN   NaN NaN
1   NaN   NaN   NaN NaN
2  a2a2  b2b2  c2c2 NaN
3  a3a3  b3b3  c3c3 NaN
4   NaN   NaN   NaN NaN
5   NaN   NaN   NaN NaN

In [22]:
result1 = pd.concat([df1, df2])
print(result1)  # Ïù¥Í±¥ Í∞ôÏùÄ Ï¢åÌëúÏóêÏÑú ÎçîÌïúÎã§Í∏∞Î≥¥Îã§ Í∑∏ÎÉ• Ïù¥Ïñ¥Î∂ôÏù¥Í∏∞..?

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
2  a2  b2  c2   d2
3  a3  b3  c3   d3
4  a4  b4  c4   d4
5  a5  b5  c5   d5

In [23]:
result1 = pd.concat([df1, df2], ignore_index=True)  # Í∏∞Ï°¥ Ïù∏Îç±Ïä§ Î¨¥ÏãúÌïòÍ≥† ÏÉàÎ°ú ÎÑòÎ≤ÑÎßÅ
print(result1)

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
4  a2  b2  c2   d2
5  a3  b3  c3   d3
6  a4  b4  c4   d4
7  a5  b5  c5   d5

In [24]:
result2 = pd.concat([df1, df2], axis='columns')
print(result2)

     a    b    c    a    b    c    d
0   a0   b0   c0  NaN  NaN  NaN  NaN
1   a1   b1   c1  NaN  NaN  NaN  NaN
2   a2   b2   c2   a2   b2   c2   d2
3   a3   b3   c3   a3   b3   c3   d3
4  NaN  NaN  NaN   a4   b4   c4   d4
5  NaN  NaN  NaN   a5   b5   c5   d5

In [25]:
result3 = pd.concat([df1, df2], axis='columns', join='inner')
print(result3)

    a   b   c   a   b   c   d
2  a2  b2  c2  a2  b2  c2  d2
3  a3  b3  c3  a3  b3  c3  d3

### üéá ???

In [27]:
df = titanic.loc[:, ['age', 'sex', 'class', 'fare', 'survived']]
print(len(df))
print(df.head())

891
    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1
3  35.0  female  First  53.1000         1
4  35.0    male  Third   8.0500         0

In [28]:
df['class'].unique()

['Third', 'First', 'Second']
Categories (3, object): ['First', 'Second', 'Third']

In [30]:
grouped = df.groupby(['class'])
print(grouped)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000170C2B48F40>

In [31]:
grouped_df = {}
for key, group in grouped:
    print('key :', key)
    print('length :', len(group))
    grouped_df[key] = group
    print(group.head())

key : First
length : 216
     age     sex  class     fare  survived
1   38.0  female  First  71.2833         1
3   35.0  female  First  53.1000         1
6   54.0    male  First  51.8625         0
11  58.0  female  First  26.5500         1
23  28.0    male  First  35.5000         1
key : Second
length : 184
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
17   NaN    male  Second  13.0000         1
20  35.0    male  Second  26.0000         0
21  34.0    male  Second  13.0000         1
key : Third
length : 491
    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
2  26.0  female  Third   7.9250         1
4  35.0    male  Third   8.0500         0
5   NaN    male  Third   8.4583         0
7   2.0    male  Third  21.0750         0

In [37]:
avg = grouped.mean().round(2)
print(avg)

          age   fare  survived
class
First   38.23  84.15      0.63
Second  29.88  20.66      0.47
Third   25.14  13.68      0.24

In [38]:
avg = grouped.max().round(2)
print(avg)

         age   sex    fare  survived
class
First   80.0  male  512.33         1
Second  70.0  male   73.50         1
Third   74.0  male   69.55         1

In [47]:
grouped_two = df.groupby(['class', 'sex'])
for key, group in grouped_two:
    print('key :', key)
    print('length :', len(group))
    print(group.head())

key : ('First', 'female')
length : 94
     age     sex  class      fare  survived
1   38.0  female  First   71.2833         1
3   35.0  female  First   53.1000         1
11  58.0  female  First   26.5500         1
31   NaN  female  First  146.5208         1
52  49.0  female  First   76.7292         1
key : ('First', 'male')
length : 122
     age   sex  class      fare  survived
6   54.0  male  First   51.8625         0
23  28.0  male  First   35.5000         1
27  19.0  male  First  263.0000         0
30  40.0  male  First   27.7208         0
34  28.0  male  First   82.1708         0
key : ('Second', 'female')
length : 76
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
41  27.0  female  Second  21.0000         0
43   3.0  female  Second  41.5792         1
53  29.0  female  Second  26.0000         1
key : ('Second', 'male')
length : 108
     age   sex   class  fare  survived
17   NaN  male  Second  13.0         1
20  35.0  male  Second  26.0         0
21  34.0  male  Second  13.0         1
33  66.0  male  Second  10.5         0
70  32.0  male  Second  10.5         0
key : ('Third', 'female')
length : 144
     age     sex  class     fare  survived
2   26.0  female  Third   7.9250         1
8   27.0  female  Third  11.1333         1
10   4.0  female  Third  16.7000         1
14  14.0  female  Third   7.8542         0
18  31.0  female  Third  18.0000         0
key : ('Third', 'male')
length : 347
     age   sex  class     fare  survived
0   22.0  male  Third   7.2500         0
4   35.0  male  Third   8.0500         0
5    NaN  male  Third   8.4583         0
7    2.0  male  Third  21.0750         0
12  20.0  male  Third   8.0500         0

In [52]:
print(grouped_two.mean().round(3))

                  age     fare  survived
class  sex
First  female  34.612  106.126     0.968
       male    41.281   67.226     0.369
Second female  28.723   21.970     0.921
       male    30.741   19.742     0.157
Third  female  21.750   16.119     0.500
       male    26.508   12.662     0.135

In [55]:
group3f = grouped_two.get_group(('Third', 'female'))
print(group3f.head().round(2))

     age     sex  class   fare  survived
2   26.0  female  Third   7.92         1
8   27.0  female  Third  11.13         1
10   4.0  female  Third  16.70         1
14  14.0  female  Third   7.85         0
18  31.0  female  Third  18.00         0

In [ ]:
# dfg = grouped

# print(dfg.loc['First'])
# print(dfg.xs('female', level='sex'))

### ‚ú® ÌîºÎ≤óÌÖåÏù¥Î∏î

In [57]:
df

      age     sex   class     fare  survived
0    22.0    male   Third   7.2500         0
1    38.0  female   First  71.2833         1
2    26.0  female   Third   7.9250         1
3    35.0  female   First  53.1000         1
4    35.0    male   Third   8.0500         0
..    ...     ...     ...      ...       ...
886  27.0    male  Second  13.0000         0
887  19.0  female   First  30.0000         1
888   NaN  female   Third  23.4500         0
889  26.0    male   First  30.0000         1
890  32.0    male   Third   7.7500         0

[891 rows x 5 columns]

In [60]:
pdf1 = pd.pivot_table(df,
                      index='class',
                      columns='sex',
                      values='age',
                      aggfunc='mean')  # age Í∞íÏùÑ Îã§ ÎÑ£ÏùÑ Ïàò ÏóÜÍ∏∞ ÎïåÎ¨∏Ïóê ÌèâÍ∑† Îì±Ïùò ÏÇ∞Ï∂úÍ∞íÏúºÎ°ú ÌâÅÏπ®
print(pdf1.round(2))
print(type(pdf1))

sex     female   male
class
First    34.61  41.28
Second   28.72  30.74
Third    21.75  26.51
<class 'pandas.core.frame.DataFrame'>

In [62]:
pdf2 = pd.pivot_table(df,
                      index='class',
                      columns='sex',
                      values=['age', 'fare'],
                      aggfunc='mean')
print(pdf2.round(2))
print(type(pdf2))

          age           fare
sex    female   male  female   male
class
First   34.61  41.28  106.13  67.23
Second  28.72  30.74   21.97  19.74
Third   21.75  26.51   16.12  12.66
<class 'pandas.core.frame.DataFrame'>

In [63]:
pdf3 = pd.pivot_table(df,
                      index='class',
                      columns='sex',
                      values='age',
                      aggfunc=['mean', 'sum', 'std'])
print(pdf3.round(2))
print(type(pdf3))

         mean            sum             std
sex    female   male  female     male female   male
class
First   34.61  41.28  2942.0  4169.42  13.61  15.14
Second  28.72  30.74  2125.5  3043.33  12.87  14.79
Third   21.75  26.51  2218.5  6706.42  12.73  12.16
<class 'pandas.core.frame.DataFrame'>

In [65]:
pdf4 = pd.pivot_table(df,
                      index=['class', 'sex'],
                      columns='survived',
                      values='age',
                      aggfunc='mean')
print(pdf4.round(2))
print(type(pdf4))

survived           0      1
class  sex
First  female  25.67  34.94
       male    44.58  36.25
Second female  36.00  28.08
       male    33.37  16.02
Third  female  23.82  19.33
       male    27.26  22.27
<class 'pandas.core.frame.DataFrame'>

In [66]:
print(pdf4.index)
print(pdf4.columns)

MultiIndex([( 'First', 'female'),
            ( 'First',   'male'),
            ('Second', 'female'),
            ('Second',   'male'),
            ( 'Third', 'female'),
            ( 'Third',   'male')],
           names=['class', 'sex'])
Int64Index([0, 1], dtype='int64', name='survived')